
## Plan Result

[CI link](https://github.com/mirror-kt/infra/actions/runs/5432174787)


<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.dmarc
  * cloudflare_record.dub_sh
  * cloudflare_record.github_pages_challenge
  * cloudflare_record.keybase
  * cloudflare_record.mail
  * cloudflare_record.mc_chun_1
  * cloudflare_record.mc_chun_2
  * cloudflare_record.pleroma
  * cloudflare_record.root
  * cloudflare_record.spf


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.dmarc will be created
  + resource "cloudflare_record" "dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.dub_sh will be created
  + resource "cloudflare_record" "dub_sh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "cname.dub.sh"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.github_pages_challenge will be created
  + resource "cloudflare_record" "github_pages_challenge" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-mirror-kt"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.keybase will be created
  + resource "cloudflare_record" "keybase" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_keybase"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + priority        = 0
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "www2800.sakura.ne.jp"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_1 will be created
  + resource "cloudflare_record" "mc_chun_1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "columbus.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_2 will be created
  + resource "cloudflare_record" "mc_chun_2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "galileo.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.pleroma will be created
  + resource "cloudflare_record" "pleroma" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pleroma"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "34.134.233.145"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "mirror-kt.pages.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:www2800.sakura.ne.jp ~all"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"02b2e85e748be0bb57a1110b59fcd1bddaf9137f","Vars":{},"WorkflowName":"Terraform"} -->